/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cor1.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gdanylov <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/09/14 05:24:24 by gdanylov          #+#    #+#             */
/*   Updated: 2018/09/14 05:24:25 by gdanylov         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

# define MEM_SIZE 4096

unsigned char c[MEM_SIZE];

typedef struct s_bin;
{
    char bot_name;
    char bot_comment;
    char bot_size;
    char bot_code;
    char bot_id;
}              t_bin;

typedef struct  s_pro
{

    // текущее положение (ПК («Счетчик программ»).)
// carry
// номер игрока который его породил
// 16 регистров (массив unsigned int register[16])
unsigned int register[16]
// жив (1 или 0)
// команду которую он исполняет
// количество циклов, сколько ему осталось ждать до исполнения команды.
}               t_pro;